DiplomT/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненыеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_Специалисты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ВыполненныеРаботы</name>
    <attributes>
      <name>ВКМ_ОписаниеРаботы</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomT/src/Documents/ВКМ_ОбслуживаниеКлиентов/Forms/ВКМ_ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

КонецПроцедуры

//***ВКМ_Доработка

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Ссылка = Документы.ВКМ_ОбслуживаниеКлиентов.ПустаяСсылка() Тогда

		ДобавитьЭлементВСправочникБота();
	
	КонецЕсли;
	
	ВКМ_РегламентноеЗаданиеОтправкиСообщений.ВКМ_ОтправкаСообщенийВТелеграм();

КонецПроцедуры

&НаКлиенте
Процедура ВКМ_СпециалистПриИзменении(Элемент)
	ВКМ_СпециалистПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВКМ_СпециалистПриИзмененииНаСервере()
	
	ДобавитьЭлементВСправочникБота();

КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ДатаПроведенияРаботПриИзменении(Элемент)
	ВКМ_ДатаПроведенияРаботПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВКМ_ДатаПроведенияРаботПриИзмененииНаСервере()
	ДобавитьЭлементВСправочникБота();
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ВремяНачалаРаботПланПриИзменении(Элемент)
	ВКМ_ВремяНачалаРаботПланПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВКМ_ВремяНачалаРаботПланПриИзмененииНаСервере()
	ДобавитьЭлементВСправочникБота();
КонецПроцедуры


&НаКлиенте
Процедура ВКМ_ВремяОкончанияРаботПланПриИзменении(Элемент)
	ВКМ_ВремяОкончанияРаботПланПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВКМ_ВремяОкончанияРаботПланПриИзмененииНаСервере()
	ДобавитьЭлементВСправочникБота();
КонецПроцедуры




//---ВКМ_Доработка

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

//***ВКМ_Доработка

&НаСервере
Процедура ДобавитьЭлементВСправочникБота()

	ДокументОбъект = ЭтотОбъект.Объект;
	ФорматДатыДляЗаписи = Лев(Формат(ДокументОбъект.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"), 10);

	ФорматВремяНачало = Лев(Формат(ДокументОбъект.ВремяНачалаРаботПлан, "ДЛФ=T;"), 8);

	ФорматВремяОкончания = Лев(Формат(ДокументОбъект.ВремяОкончанияРаботПлан, "ДЛФ=T;"), 8);

	ТекстУведомленияБота = СтрШаблон("Специалист: %1,
									 |Дата: %2,
									 |Время Начала: %3,
									 |Время Окончания: %4.", ДокументОбъект.Специалист, ФорматДатыДляЗаписи,
		ФорматВремяНачало, ФорматВремяОкончания);

	ЭлементСправочникаУведомлений = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	ЭлементСправочникаУведомлений.Текст = ТекстУведомленияБота;

	ЭлементСправочникаУведомлений.Записать();
	
		//ВКМ_Телеграм.ПолучитьЭлементСправочника();
		//ВКМ_РегламентноеЗаданиеОтправкиСообщений.ВКМ_ОтправкаСообщенийВТелеграм();
		
		
КонецПроцедуры


//---ВКМ_Доработка
#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
